Isaac-Inspire-Contact-Sweep-Clutter-v0


이 환경을 계승하는 v1 환경을 만들어줘. 이 환경은 다음과 같은 조건을 가진다.

1. Observation의 변경:
- 타겟 물체의 "실시간 좌표 관측"을, 타겟 물체의 "시작 위치 관측" 으로 변경한다.
- 이후, 타겟 물체의 "실시간 위치 관측"은 Critic Network 관측이 사용하도록 변경한다. "src/inspire_sweep_baseline/inspire_sweep_baseline/agents/initial_privileged_ppo_cfg.py" 를 사용하는 환경을 참조할 것


2. Reward의 변경:
   1. Goal 유지 보상의 추가: 
      타겟 물체의 좌표가, 목표하는 위치의 반경 1cm 이내에 있으면 증가하는 보상을 추가한다.
      단, 전체 거리가 아닌, xy 평면에서 차이만 사용한다. 이 때의 xy라는 것은 하늘 방향을 z로 취급하였을 때의 평면을 의미한다.

   2. Contact 보상의 추가: 2개의 항의 합으로 구성된다.
      1. Tactile 센서 중, 단 하나라도 ON이면 들어오는 보상
      2. 접촉하는 Tactile의 수에 비례하는 보상. 최소일 때는 0개의 Tactile, 최대일 때는 5개의 Tactile로 취급한다. 즉, 6개 이상부터는 5개 접촉과 동등한 보상을 받는다.
      3. 2-2-1, 2-2-2는 최대 접촉 기준으로 같은 보상량을 가지며, 5개의 Tactile을 7초간 계속 유지한다고 가정할 때, 전체 보상의 약 10% 수준을 가지도록 Weight를 세팅하라.

   3. 장애 물체를 이동시키는 페널티 추가:
      타겟 물체를 제외한, 다른 물체들(장애물)에 대하여 초기 위치 대비 이동한 거리의 제곱의 합에 비례하는 페널티를 부여
      이 페널티는 전체 리워드에서 빼는 방식으로 적용된다. 타겟 물체의 이동은 페널티에 포함하지 않는다. 추가적으로, PPO 오류를 방지하기 위해, 최대 페널티 수치를 설정한다. 

3. 일부 Reward의 수정:
   - "pushing_speed" 리워드 텀의 free speed를 0.2 -> 1.0 으로 변경한다.
   - "arm_speed_excess" 리워드 텀의 free speed를 1.0 -> 0.5 으로 변경한다.

---

이과 같은 리워드를 구성하여, 결과적으로 다음과 같은 수준의 보상 비중을 가지기를 희망한다.

1. Reaching : 전체 리워드 비중의 약 35%를 차지하도록 설정한다.
2. Goal Distance : 전체 리워드 비중의 약 35%를 차지하도록 설정한다.
3. Goal 유지 : 10초 중 5초 동안 목표 위치에 도달하였다고 가정할 때, 전체 리워드 비중의 약 20%를 차지하도록 설정한다.
4. Contact : 1개라도 접촉과 5개 전체 접촉을 기준으로 1:1의 비중을 가지며, 둘을 합쳐 전체 리워드 비중의 약 10%를 차지하도록 설정한다.
5. 장애물 이동 페널티 : 엄밀한 수치는 미지수이지만, 그렇게 까지 큰 페널티로 차지하지는 않는다. 물체 2개가 시작부터 초기 위치보다 각각 10cm 씩 떨어진 위치로 가정해도, 전체 보상 수준의 abs(10%) 이상의 페널티를 주지 않도록 설정한다.

위 4개의 리워드 계수 조정은 '/home/min/7cmdehdrb/grad/logs/TEMP/2026-10-20_14-04-31' 이 학습 로그를 참조로 조정을 수행하며, 저 비중은 엄밀하게 지키는 값이 아니다. 애초에 보상이라는게 계산한 수치가 나올 수 없기 때문에, 이론상 이정도 나와야 한다와, 실제로 얻은 리워드 수치를 대조하여, 적정한 보상 식 및 계수를 조정하는 방식으로 진행한다.